Revit 2024 API
BuiltInFailures.JoinElementsFailures.ElementWillBeDetachedFromPlane Property
 Element will be detached from its associated plane
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ElementWillBeDetachedFromPlane { get; }
Visual Basic
Public Shared ReadOnly Property ElementWillBeDetachedFromPlane As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ElementWillBeDetachedFromPlane {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace